RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_dma.h
  __IO HAL_DMA_StateTypeDef State;                                 /*!< DMA transfer state                      */

  __IO uint32_t             ErrorCode;                             /*!< DMA error code                          */

  void                      *Parent;                               /*!< Parent object state                     */

  void (* XferCpltCallback)(struct __DMA_HandleTypeDef *hdma);     /*!< DMA transfer complete callback          */

  void (* XferHalfCpltCallback)(struct __DMA_HandleTypeDef *hdma); /*!< DMA half transfer complete callback     */

  void (* XferErrorCallback)(struct __DMA_HandleTypeDef *hdma);    /*!< DMA transfer error callback             */

  void (* XferAbortCallback)(struct __DMA_HandleTypeDef *hdma);    /*!< DMA transfer Abort callback             */

  void (* XferSuspendCallback)(struct __DMA_HandleTypeDef *hdma);  /*!< DMA transfer Suspend callback           */

  struct __DMA_QListTypeDef  *LinkedListQueue;                     /*!< DMA linked-list queue                   */

} DMA_HandleTypeDef;
/**
  * @}
  */


/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @brief    DMA Exported constants
  * @{
  */

/** @defgroup DMA_Error_Codes DMA Error Codes
  * @brief    DMA Error Codes
  * @{
  */
#define HAL_DMA_ERROR_NONE             (0x0000U) /*!< No error                      */
#define HAL_DMA_ERROR_DTE              (0x0001U) /*!< Data transfer error           */
#define HAL_DMA_ERROR_ULE              (0x0002U) /*!< Update linked-list item error */
#define HAL_DMA_ERROR_USE              (0x0004U) /*!< User setting error            */
#define HAL_DMA_ERROR_TO               (0x0008U) /*!< Trigger overrun error         */
#define HAL_DMA_ERROR_TIMEOUT          (0x0010U) /*!< Timeout error                 */
#define HAL_DMA_ERROR_NO_XFER          (0x0020U) /*!< No transfer ongoing error     */
#define HAL_DMA_ERROR_BUSY             (0x0040U) /*!< Busy error                    */
#define HAL_DMA_ERROR_INVALID_CALLBACK (0x0080U) /*!< Invalid callback error        */
#define HAL_DMA_ERROR_NOT_SUPPORTED    (0x0100U) /*!< Not supported mode            */
/**
  * @}
  */

/** @defgroup DMA_Interrupt_Enable_Definition DMA Interrupt Enable Definition
  * @brief    DMA Interrupt Enable Definition
  * @{
  */
#define DMA_IT_TC   DMA_CCR_TCIE   /*!< Transfer complete interrupt             */
#define DMA_IT_HT   DMA_CCR_HTIE   /*!< Half transfer complete interrupt        */
#define DMA_IT_DTE  DMA_CCR_DTEIE  /*!< Data transfer error interrupt           */
#define DMA_IT_ULE  DMA_CCR_ULEIE  /*!< Update linked-list item error interrupt */
#define DMA_IT_USE  DMA_CCR_USEIE  /*!< User eetting error interrupt            */
#define DMA_IT_SUSP DMA_CCR_SUSPIE /*!< Completed suspension interrupt          */
#define DMA_IT_TO   DMA_CCR_TOIE   /*!< Trigger overrun interrupt               */
/**
  * @}
  */

/** @defgroup DMA_Flag_Definition DMA Flag Definition
  * @brief    DMA Flag Definition
  * @{
  */
#define DMA_FLAG_IDLE DMA_CSR_IDLEF /*!< Idle flag                          */
#define DMA_FLAG_TC   DMA_CSR_TCF   /*!< Transfer complete flag             */
#define DMA_FLAG_HT   DMA_CSR_HTF   /*!< Half transfer complete flag        */
#define DMA_FLAG_DTE  DMA_CSR_DTEF  /*!< Data transfer error flag           */
#define DMA_FLAG_ULE  DMA_CSR_ULEF  /*!< Update linked-list item error flag */
#define DMA_FLAG_USE  DMA_CSR_USEF  /*!< User setting error flag            */
#define DMA_FLAG_SUSP DMA_CSR_SUSPF /*!< Completed suspension flag          */
#define DMA_FLAG_TO   DMA_CSR_TOF   /*!< Trigger overrun flag               */
/**
  * @}
  */

/** @defgroup DMA_Request_Selection DMA Request Selection
  * @brief    DMA Request Selection
  * @{
  */
/* HPDMA1 requests */
#define HPDMA1_REQUEST_JPEG_RX        0U       /*!< HPDMA1 HW request is JPEG_DMA_RX    */
#define HPDMA1_REQUEST_JPEG_TX        1U       /*!< HPDMA1 HW request is JPEG_DMA_TX    */
#define HPDMA1_REQUEST_XSPI1          2U       /*!< HPDMA1 HW request is XSPI1          */
#define HPDMA1_REQUEST_XSPI2          3U       /*!< HPDMA1 HW request is XSPI2          */
#define HPDMA1_REQUEST_SPI3_RX        4U       /*!< HPDMA1 HW request is SPI3_RX        */
#define HPDMA1_REQUEST_SPI3_TX        5U       /*!< HPDMA1 HW request is SPI3_TX        */
#define HPDMA1_REQUEST_SPI4_RX        6U       /*!< HPDMA1 HW request is SPI4_RX        */
#define HPDMA1_REQUEST_SPI4_TX        7U       /*!< HPDMA1 HW request is SPI4_TX        */
#define HPDMA1_REQUEST_ADC1           8U       /*!< HPDMA1 HW request is ADC1           */
#define HPDMA1_REQUEST_ADC2           9U       /*!< HPDMA1 HW request is ADC2           */
#define HPDMA1_REQUEST_ADF1_FLT0      10U      /*!< HPDMA1 HW request is ADF1_FLT0      */
#define HPDMA1_REQUEST_UART4_RX       11U      /*!< HPDMA1 HW request is UART4_RX       */
#define HPDMA1_REQUEST_UART4_TX       12U      /*!< HPDMA1 HW request is UART4_TX       */
#define HPDMA1_REQUEST_UART5_RX       13U      /*!< HPDMA1 HW request is UART5_RX       */
#define HPDMA1_REQUEST_UART5_TX       14U      /*!< HPDMA1 HW request is UART5_TX       */
#define HPDMA1_REQUEST_UART7_RX       15U      /*!< HPDMA1 HW request is UART7_RX       */
#define HPDMA1_REQUEST_UART7_TX       16U      /*!< HPDMA1 HW request is UART7_TX       */
#define HPDMA1_REQUEST_LPTIM2_IC1     17U      /*!< HPDMA1 HW request is LPTIM2_IC1     */
#define HPDMA1_REQUEST_LPTIM2_IC2     18U      /*!< HPDMA1 HW request is LPTIM2_IC2     */
#define HPDMA1_REQUEST_LPTIM2_UE      19U      /*!< HPDMA1 HW request is LPTIM2_UE      */

/* GPDMA1 requests */
#define GPDMA1_REQUEST_ADC1           0U       /*!< GPDMA1 HW request is ADC1           */
#define GPDMA1_REQUEST_ADC2           1U       /*!< GPDMA1 HW request is ADC2           */
#define GPDMA1_REQUEST_CRYP_IN        2U       /*!< GPDMA1 HW request is CRYP_IN        */
#define GPDMA1_REQUEST_CRYP_OUT       3U       /*!< GPDMA1 HW request is CRYP_OUT       */
#define GPDMA1_REQUEST_SAES_IN        4U       /*!< GPDMA1 HW request is SAES_IN        */
#define GPDMA1_REQUEST_SAES_OUT       5U       /*!< GPDMA1 HW request is SAES_OUT       */
#define GPDMA1_REQUEST_HASH_IN        6U       /*!< GPDMA1 HW request is HASH_IN        */
#define GPDMA1_REQUEST_TIM1_CH1       7U       /*!< GPDMA1 HW request is TIM1_CH1       */
#define GPDMA1_REQUEST_TIM1_CH2       8U       /*!< GPDMA1 HW request is TIM1_CH2       */
#define GPDMA1_REQUEST_TIM1_CH3       9U       /*!< GPDMA1 HW request is TIM1_CH3       */
#define GPDMA1_REQUEST_TIM1_CH4       10U      /*!< GPDMA1 HW request is TIM1_CH4       */
#define GPDMA1_REQUEST_TIM1_UP        11U      /*!< GPDMA1 HW request is TIM1_UP        */
#define GPDMA1_REQUEST_TIM1_TRIG      12U      /*!< GPDMA1 HW request is TIM1_TRIG      */
#define GPDMA1_REQUEST_TIM1_COM       13U      /*!< GPDMA1 HW request is TIM1_COM       */
#define GPDMA1_REQUEST_TIM2_CH1       14U      /*!< GPDMA1 HW request is TIM2_CH1       */
#define GPDMA1_REQUEST_TIM2_CH2       15U      /*!< GPDMA1 HW request is TIM2_CH2       */
#define GPDMA1_REQUEST_TIM2_CH3       16U      /*!< GPDMA1 HW request is TIM2_CH3       */
#define GPDMA1_REQUEST_TIM2_CH4       17U      /*!< GPDMA1 HW request is TIM2_CH4       */
#define GPDMA1_REQUEST_TIM2_UP        18U      /*!< GPDMA1 HW request is TIM2_UP        */
#define GPDMA1_REQUEST_TIM2_TRIG      19U      /*!< GPDMA1 HW request is TIM2_TRIG      */
#define GPDMA1_REQUEST_TIM3_CH1       20U      /*!< GPDMA1 HW request is TIM3_CH1       */
#define GPDMA1_REQUEST_TIM3_CH2       21U      /*!< GPDMA1 HW request is TIM3_CH2       */
#define GPDMA1_REQUEST_TIM3_CH3       22U      /*!< GPDMA1 HW request is TIM3_CH3       */
#define GPDMA1_REQUEST_TIM3_CH4       23U      /*!< GPDMA1 HW request is TIM3_CH4       */
#define GPDMA1_REQUEST_TIM3_UP        24U      /*!< GPDMA1 HW request is TIM3_UP        */
#define GPDMA1_REQUEST_TIM3_TRIG      25U      /*!< GPDMA1 HW request is TIM3_TRIG      */
#define GPDMA1_REQUEST_TIM4_CH1       26U      /*!< GPDMA1 HW request is TIM4_CH1       */
#define GPDMA1_REQUEST_TIM4_CH2       27U      /*!< GPDMA1 HW request is TIM4_CH2       */
#define GPDMA1_REQUEST_TIM4_CH3       28U      /*!< GPDMA1 HW request is TIM4_CH3       */
#define GPDMA1_REQUEST_TIM4_CH4       29U      /*!< GPDMA1 HW request is TIM4_CH4       */
#define GPDMA1_REQUEST_TIM4_UP        30U      /*!< GPDMA1 HW request is TIM4_UP        */
#define GPDMA1_REQUEST_TIM4_TRIG      31U      /*!< GPDMA1 HW request is TIM4_TRIG      */
#define GPDMA1_REQUEST_TIM5_CH1       32U      /*!< GPDMA1 HW request is TIM5_CH1       */
#define GPDMA1_REQUEST_TIM5_CH2       33U      /*!< GPDMA1 HW request is TIM5_CH2       */
#define GPDMA1_REQUEST_TIM5_CH3       34U      /*!< GPDMA1 HW request is TIM5_CH3       */
#define GPDMA1_REQUEST_TIM5_CH4       35U      /*!< GPDMA1 HW request is TIM5_CH4       */
#define GPDMA1_REQUEST_TIM5_UP        36U      /*!< GPDMA1 HW request is TIM5_UP        */
#define GPDMA1_REQUEST_TIM5_TRIG      37U      /*!< GPDMA1 HW request is TIM5_TRIG      */
#define GPDMA1_REQUEST_TIM6_UP        38U      /*!< GPDMA1 HW request is TIM6_UP        */
#define GPDMA1_REQUEST_TIM7_UP        39U      /*!< GPDMA1 HW request is TIM7_UP        */
#define GPDMA1_REQUEST_TIM15_CH1      40U      /*!< GPDMA1 HW request is TIM15_CH1      */
#define GPDMA1_REQUEST_TIM15_CH2      41U      /*!< GPDMA1 HW request is TIM15_CH2      */
#define GPDMA1_REQUEST_TIM15_UP       42U      /*!< GPDMA1 HW request is TIM15_UP       */
#define GPDMA1_REQUEST_TIM15_TRIG     43U      /*!< GPDMA1 HW request is TIM15_TRIG     */
#define GPDMA1_REQUEST_TIM15_COM      44U      /*!< GPDMA1 HW request is TIM15_COM      */
#define GPDMA1_REQUEST_TIM16_CH1      45U      /*!< GPDMA1 HW request is TIM16_CH1      */
#define GPDMA1_REQUEST_TIM16_UP       46U      /*!< GPDMA1 HW request is TIM16_UP       */
#define GPDMA1_REQUEST_TIM16_COM      47U      /*!< GPDMA1 HW request is TIM16_COM      */
#define GPDMA1_REQUEST_TIM17_CH1      48U      /*!< GPDMA1 HW request is TIM17_CH1      */
#define GPDMA1_REQUEST_TIM17_UP       49U      /*!< GPDMA1 HW request is TIM17_UP       */
#define GPDMA1_REQUEST_TIM17_COM      50U      /*!< GPDMA1 HW request is TIM17_COM      */
#define GPDMA1_REQUEST_SPI1_RX        51U      /*!< GPDMA1 HW request is SPI1_RX        */
#define GPDMA1_REQUEST_SPI1_TX        52U      /*!< GPDMA1 HW request is SPI1_TX        */
#define GPDMA1_REQUEST_SPI2_RX        53U      /*!< GPDMA1 HW request is SPI2_RX        */
#define GPDMA1_REQUEST_SPI2_TX        54U      /*!< GPDMA1 HW request is SPI2_TX        */
#define GPDMA1_REQUEST_SPI3_RX        55U      /*!< GPDMA1 HW request is SPI3_RX        */
#define GPDMA1_REQUEST_SPI3_TX        56U      /*!< GPDMA1 HW request is SPI3_TX        */
#define GPDMA1_REQUEST_SPI4_RX        57U      /*!< GPDMA1 HW request is SPI4_RX        */
#define GPDMA1_REQUEST_SPI4_TX        58U      /*!< GPDMA1 HW request is SPI4_TX        */
#define GPDMA1_REQUEST_SPI5_RX        59U      /*!< GPDMA1 HW request is SPI5_RX        */
#define GPDMA1_REQUEST_SPI5_TX        60U      /*!< GPDMA1 HW request is SPI5_TX        */
#define GPDMA1_REQUEST_SPI6_RX        61U      /*!< GPDMA1 HW request is SPI6_RX        */
#define GPDMA1_REQUEST_SPI6_TX        62U      /*!< GPDMA1 HW request is SPI6_TX        */
#define GPDMA1_REQUEST_SAI1_A         63U      /*!< GPDMA1 HW request is SAI1_A         */
#define GPDMA1_REQUEST_SAI1_B         64U      /*!< GPDMA1 HW request is SAI1_B         */
#define GPDMA1_REQUEST_SAI2_A         65U      /*!< GPDMA1 HW request is SAI2_A         */
#define GPDMA1_REQUEST_SAI2_B         66U      /*!< GPDMA1 HW request is SAI2_B         */
#define GPDMA1_REQUEST_I2C1_RX        67U      /*!< GPDMA1 HW request is I2C1_RX        */
#define GPDMA1_REQUEST_I2C1_TX        68U      /*!< GPDMA1 HW request is I2C1_TX        */
#define GPDMA1_REQUEST_I2C2_RX        69U      /*!< GPDMA1 HW request is I2C2_RX        */
#define GPDMA1_REQUEST_I2C2_TX        70U      /*!< GPDMA1 HW request is I2C2_TX        */
#define GPDMA1_REQUEST_I2C3_RX        71U      /*!< GPDMA1 HW request is I2C3_RX        */
#define GPDMA1_REQUEST_I2C3_TX        72U      /*!< GPDMA1 HW request is I2C3_TX        */
#define GPDMA1_REQUEST_USART1_RX      73U      /*!< GPDMA1 HW request is USART1_RX      */
#define GPDMA1_REQUEST_USART1_TX      74U      /*!< GPDMA1 HW request is USART1_TX      */
#define GPDMA1_REQUEST_USART2_RX      75U      /*!< GPDMA1 HW request is USART2_RX      */
#define GPDMA1_REQUEST_USART2_TX      76U      /*!< GPDMA1 HW request is USART2_TX      */
#define GPDMA1_REQUEST_USART3_RX      77U      /*!< GPDMA1 HW request is USART3_RX      */
#define GPDMA1_REQUEST_USART3_TX      78U      /*!< GPDMA1 HW request is USART3_TX      */
#define GPDMA1_REQUEST_UART4_RX       79U      /*!< GPDMA1 HW request is UART4_RX       */
#define GPDMA1_REQUEST_UART4_TX       80U      /*!< GPDMA1 HW request is UART4_TX       */
#define GPDMA1_REQUEST_UART5_RX       81U      /*!< GPDMA1 HW request is UART5_RX       */
#define GPDMA1_REQUEST_UART5_TX       82U      /*!< GPDMA1 HW request is UART5_TX       */
#define GPDMA1_REQUEST_UART7_RX       83U      /*!< GPDMA1 HW request is UART7_RX       */
#define GPDMA1_REQUEST_UART7_TX       84U      /*!< GPDMA1 HW request is UART7_TX       */
#define GPDMA1_REQUEST_UART8_RX       85U      /*!< GPDMA1 HW request is UART8_RX       */
#define GPDMA1_REQUEST_UART8_TX       86U      /*!< GPDMA1 HW request is UART8_TX       */
#define GPDMA1_REQUEST_CORDIC_READ    87U      /*!< GPDMA1 HW request is CORDIC_READ    */
#define GPDMA1_REQUEST_CORDIC_WRITE   88U      /*!< GPDMA1 HW request is CORDIC_WRITE   */
#define GPDMA1_REQUEST_LPTIM1_IC1     89U      /*!< GPDMA1 HW request is LPTIM1_IC1     */
#define GPDMA1_REQUEST_LPTIM1_IC2     90U      /*!< GPDMA1 HW request is LPTIM1_IC2     */
#define GPDMA1_REQUEST_LPTIM1_UE      91U      /*!< GPDMA1 HW request is LPTIM1_UE      */
#define GPDMA1_REQUEST_LPTIM2_IC1     92U      /*!< GPDMA1 HW request is LPTIM2_IC1     */
#define GPDMA1_REQUEST_LPTIM2_IC2     93U      /*!< GPDMA1 HW request is LPTIM2_IC2     */
#define GPDMA1_REQUEST_LPTIM2_UE      94U      /*!< GPDMA1 HW request is LPTIM2_UE      */
#define GPDMA1_REQUEST_SPDIF_RX_DT    95U      /*!< GPDMA1 HW request is SPDIF_RX_DT    */
#define GPDMA1_REQUEST_SPDIF_RX_CS    96U      /*!< GPDMA1 HW request is SPDIF_RX_CS    */
#define GPDMA1_REQUEST_ADF1_FLT0      97U      /*!< GPDMA1 HW request is ADF1_FLT0      */
#define GPDMA1_REQUEST_UCPD1_TX       98U      /*!< GPDMA1 HW request is UCPD1_TX       */
#define GPDMA1_REQUEST_UCPD1_RX       99U      /*!< GPDMA1 HW request is UCPD1_RX       */
#define GPDMA1_REQUEST_PSSI           100U      /*!< GPDMA1 HW request is PSSI          */
#define GPDMA1_REQUEST_LPUART1_RX     101U      /*!< GPDMA1 HW request is LPUART1_RX    */
#define GPDMA1_REQUEST_LPUART1_TX     102U      /*!< GPDMA1 HW request is LPUART1_TX    */
#define GPDMA1_REQUEST_LPTIM3_IC1     103U      /*!< GPDMA1 HW request is LPTIM3_IC1    */
#define GPDMA1_REQUEST_LPTIM3_IC2     104U      /*!< GPDMA1 HW request is LPTIM3_IC2    */
#define GPDMA1_REQUEST_LPTIM3_UE      105U      /*!< GPDMA1 HW request is LPTIM3_UE     */
#define GPDMA1_REQUEST_I3C1_RX        106U      /*!< GPDMA1 HW request is I3C1_RX       */
#define GPDMA1_REQUEST_I3C1_TX        107U      /*!< GPDMA1 HW request is I3C1_TX       */
#define GPDMA1_REQUEST_I3C1_TC        108U      /*!< GPDMA1 HW request is I3C1_TC       */
#define GPDMA1_REQUEST_I3C1_RS        109U      /*!< GPDMA1 HW request is I3C1_RS       */

